Took a few weeks off to recharge before heading back to work. Figured I would finish up this PR before switching gears.

I have ran `terraform plan` and `terraform apply` manually to create the `s3` bucket necessary to hold Lambda functions.

`terraform plan`
```
Terraform will perform the following actions:

  # aws_s3_bucket.lambda_bucket will be created
  + resource "aws_s3_bucket" "lambda_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "katies-lambda-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "katies_lambda_bucket"
        }
      + tags_all                    = {
          + "Name" = "katies_lambda_bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

`terreform apply`
```
aws_s3_bucket.lambda_bucket: Creating...
aws_s3_bucket.lambda_bucket: Creation complete after 1s [id=katies-lambda-bucket]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:
...
```

Rebasing and merging.